# Connection to SQL Laboratory

We are going to import the libraries needed to connect with MySQL.

First, we need to install the MySQL connector:

In [1]:
#!pip install mysql-connector-python

In [2]:
#!pip install sqlalchemy

Then we will use the library sqlalchemy to establish the connection to our engine.

Pandas will be needed to transform tables into dataframes and vice-versa.

In [3]:
from sqlalchemy import create_engine, text
import pandas as pd

## Setting up the connection string

In [4]:
# connection string parameters
# these are the parameters to acess MY server
# in case of running MySQL locally, the user and password are the ones you defined
username='nuclio-user' # if running locally, the default user is root
password='nuclio-password'
# the host must be an IP address or DNS
# if local: localhost
host='167.99.211.200' # my server public IP address
port= 'PORT'

# create connection string
#connStr='mysql+mysqlconnector://'+username+':'+password+'@'+host+':'+port+'/classicmodels'
connStr='mysql+mysqlconnector://'+username+':'+password+'@'+host
print(connStr)

# instantiate engine
engine=create_engine(connStr)
# connect to server
conn=engine.connect()

mysql+mysqlconnector://nuclio-user:nuclio-password@167.99.211.200

# Execute SQL queries

In [5]:
# show server databases
sql_query = 'SHOW DATABASES'
res=conn.execute(text(sql_query))

# display execution results
res.fetchall()

[('classicmodels',),
 ('information_schema',),
 ('mysql',),
 ('nuclio',),
 ('performance_schema',),
 ('sakila',)]

# conectando ao bd classicmodels

In [6]:
conn.execute(text('USE classicmodels'))

# Pegando Tabelas

# Mostrando tabelas

In [7]:
df_tabelas = pd.read_sql(text('SHOW TABLES'), conn)
df_tabelas

   Tables_in_classicmodels
0                customers
1                employees
2                  offices
3             orderdetails
4                   orders
5                 payments
6             productlines
7                 products
8                     rev_
9                    revi_
10                  review
11                 reviews
12             reviews_sql

# salvando schema de determinada tabela

# Exerc√≠cios

# Quest√£o 1
<p>
Seleciona o nome, linha de produto e pre√ßo m√©dio de revenda (MSRP) dos produtos
cujo pre√ßo de revenda √© pelo menos 2 vezes superior ao pre√ßo de compra (buyPrice)
e o pre√ßo de compra seja superior a 50 euros.</p>

### Query

In [8]:
df_q1 = pd.read_sql("""
    select
        prod.productName,
        prod.productLine,
        prod.MSRP
    from
        classicmodels.products as prod
    where
        prod.MSRP > 2* prod.buyPrice and
        prod.buyPrice > 50
        

        """,
conn)
df_q1

                             productName       productLine    MSRP
0               1952 Alpine Renault 1300      Classic Cars  214.30
1   2003 Harley-Davidson Eagle Drag Bike       Motorcycles  193.66
2                      1968 Ford Mustang      Classic Cars  194.57
3                      2001 Ferrari Enzo      Classic Cars  207.80
4                       2002 Suzuki XREO       Motorcycles  150.62
5                       1969 Ford Falcon      Classic Cars  173.02
6                      1957 Chevy Pickup  Trucks and Buses  118.50
7                 1940 Ford Pickup Truck  Trucks and Buses  116.67
8            1980s Black Hawk Helicopter            Planes  157.69
9              1932 Model A Ford J-Coupe      Vintage Cars  127.13
10                1928 Mercedes-Benz SSK      Vintage Cars  168.75
11          1999 Indy 500 Monte Carlo SS      Classic Cars  132.00
12           1992 Ferrari 360 Spider red      Classic Cars  169.34
13                 1976 Ford Gran Torino      Classic Cars  146.99
14        1948 Porsche Type 356 Roadster      Classic Cars  141.28
15             1957 Corvette Convertible      Classic Cars  148.80
16              1962 Volkswagen Microbus  Trucks and Buses  127.79

# Quest√£o 2
Seleciona o nome e a quantidade total dos 10 produtos mais comprados.

In [9]:
df_q2 = pd.read_sql("""
    SELECT 
        products.productName,
         FORMAT(SUM(orderdetails.quantityOrdered),0) AS sum_quantityOrdered
    FROM
        classicmodels.orders
    JOIN
        classicmodels.orderdetails on orderdetails.orderNumber = orders.orderNumber
    JOIN
        classicmodels.products on orderdetails.productCode = products.productCode
    GROUP BY
        (products.productName)
    ORDER BY
        sum(orderdetails.quantityOrdered) DESC
    LIMIT 10     

        """,
conn)
df_q2

                               productName sum_quantityOrdered
0              1992 Ferrari 360 Spider red               1,808
1                     1937 Lincoln Berline               1,111
2                American Airlines: MD-11S               1,085
3  1941 Chevrolet Special Deluxe Cabriolet               1,076
4             1930 Buick Marquette Phaeton               1,074
5                         1940s Ford truck               1,061
6    1969 Harley Davidson Ultimate Chopper               1,057
7                        1957 Chevy Pickup               1,056
8                   1964 Mercedes Tour Bus               1,053
9                  1956 Porsche 356A Coupe               1,052

# Quest√£o 3

Seleciona o nome e n√∫mero de telefone dos clientes cuja taxa de insucesso das
encomendas √© superior a 30%. <br>
A taxa de insucesso √© calculada pela f√≥rmula: <br>
    $${ùëáùëéùë•ùëé\: ùëëùëí \:ùëñùëõùë†ùë¢ùëêùëíùë†ùë†ùëú} =   \Bigg(\frac{ùëÅ√∫ùëöùëíùëüùëú\: ùëëùëí\: ùëíùëõùëêùëúùëöùëíùëõùëëùëéùë†\: ùëõùëúùë†\: ùëíùë†ùë°ùëéùëëùëúùë†\: ùëëùëí \:ùëñùëõùë†ùë¢ùëêùëíùë†ùë†ùëú}{ùëÅ√∫ùëöùëíùëüùëú\: ùëëùëí\: ùëíùëõùëêùëúùëöùëíùëõùëëùëéùë†\: ùëõùëú \:ùëíùë†ùë°ùëéùëëùëú \:ùëÜ‚Ñéùëñùëùùëùùëíùëë}\Bigg)$$
  


sendo os estados de insucesso Resolved, Cancelled, Disputed, OnHold

In [10]:
df_q3 = pd.read_sql("""
    WITH 
        CTE_RESULTS AS (
            SELECT
                orders.customerNumber,
                customers.phone,
                count(case when orders.status IN ('Shipped') then 1 end) as qtd_shipped,
                count(case when orders.status IN ('Resolved', 'Cancelled', 'Disputed', 'On Hold') then 1 end) as qtd_fail,
                (count(case when orders.status IN ('Resolved', 'Cancelled', 'Disputed', 'On Hold') then 1 end) / count(case when orders.status IN ('Shipped') then 1 end)) as TAXA_INSUCESSO
            FROM
                classicmodels.orders
            LEFT JOIN 
                classicmodels.customers on orders.customerNumber = customers.customerNumber
            GROUP BY 
                orders.customerNumber, 
                customers.phone
        )
    SELECT
        phone
    FROM CTE_RESULTS
    WHERE TAXA_INSUCESSO > 0.3
""",
conn)
df_q3

             phone
0       31 12 3555
1       2125557818
2     0921-12 3555
3    +64 9 5555500
4       6265557265
5        7675-3555
6     0695-34 6555
7   61-9-3844-6555
8     64-9-3763555
9       2015559350
10      4085553659
11  (171) 555-2282
12      6175559555

# Explora√ß√£o

In [11]:
def ret_df_print_desc(table:str)-> pd.DataFrame:
    print(pd.read_sql(text(f'DESC classicmodels.{table}'),conn))
    df = pd.read_sql(f'select * from classicmodels.{table}',conn)
    #print(df.head(3))
    return df

## Products

In [12]:
df_products = ret_df_print_desc('products')
df_products.head(3)

                Field           Type Null  Key Default Extra
0         productCode    varchar(15)   NO  PRI    None
1         productName    varchar(70)   NO         None
2         productLine    varchar(50)   NO  MUL    None
3        productScale    varchar(10)   NO         None
4       productVendor    varchar(50)   NO         None
5  productDescription           text   NO         None
6     quantityInStock       smallint   NO         None
7            buyPrice  decimal(10,2)   NO         None
8                MSRP  decimal(10,2)   NO         None

,productCode,productName,productLine,productScale,productVendor,productDescription,quantityInStock,buyPrice,MSRP
0,S10_1678,1969 Harley Davidson Ultimate Chopper,Motorcycles,1:10,Min Lin Diecast,"This replica features working kickstand, front...",7933,48.81,95.70
1,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,Turnable front wheels; steering function; deta...,7305,98.58,214.30
2,S10_2016,1996 Moto Guzzi 1100i,Motorcycles,1:10,Highway 66 Mini Classics,"Official Moto Guzzi logos and insignias, saddl...",6625,68.99,118.94

## Orders

In [13]:
df_orders = ret_df_print_desc('orders')
df_orders.head(3)

            Field         Type Null  Key Default Extra
0     orderNumber          int   NO  PRI    None
1       orderDate         date   NO         None
2    requiredDate         date   NO         None
3     shippedDate         date  YES         None
4          status  varchar(15)   NO         None
5        comments         text  YES         None
6  customerNumber          int   NO  MUL    None

,orderNumber,orderDate,requiredDate,shippedDate,status,comments,customerNumber
0,10100,2003-01-06,2003-01-13,2003-01-10,Shipped,None,363
1,10101,2003-01-09,2003-01-18,2003-01-11,Shipped,Check on availability.,128
2,10102,2003-01-10,2003-01-18,2003-01-14,Shipped,None,181

In [14]:
df_orders['status'].value_counts()

status
Shipped       303
Cancelled       6
In Process      6
Resolved        4
On Hold         4
Disputed        3
Name: count, dtype: int64

## orderdetails

In [15]:
df_orderdetails = ret_df_print_desc('orderdetails')
df_orderdetails.head(3)

             Field           Type Null  Key Default Extra
0      orderNumber            int   NO  PRI    None
1      productCode    varchar(15)   NO  PRI    None
2  quantityOrdered            int   NO         None
3        priceEach  decimal(10,2)   NO         None
4  orderLineNumber       smallint   NO         None

   orderNumber productCode  quantityOrdered  priceEach  orderLineNumber
0        10100    S18_1749               30     136.00                3
1        10100    S18_2248               50      55.09                2
2        10100    S18_4409               22      75.46                4

## payments

In [16]:
df_payments = ret_df_print_desc('payments')
df_payments.head(3)

            Field           Type Null  Key Default Extra
0  customerNumber            int   NO  PRI    None
1     checkNumber    varchar(50)   NO  PRI    None
2     paymentDate           date   NO         None
3          amount  decimal(10,2)   NO         None

   customerNumber checkNumber paymentDate    amount
0             103    HQ336336  2004-10-19   6066.78
1             103    JM555205  2003-06-05  14571.44
2             103    OM314933  2004-12-18   1676.14

## customers

In [17]:
df_customers = ret_df_print_desc('customers')
df_customers.head(3)

                     Field           Type Null  Key Default Extra
0           customerNumber            int   NO  PRI    None
1             customerName    varchar(50)   NO         None
2          contactLastName    varchar(50)   NO         None
3         contactFirstName    varchar(50)   NO         None
4                    phone    varchar(50)   NO         None
5             addressLine1    varchar(50)   NO         None
6             addressLine2    varchar(50)  YES         None
7                     city    varchar(50)   NO         None
8                    state    varchar(50)  YES         None
9               postalCode    varchar(15)  YES         None
10                 country    varchar(50)   NO         None
11  salesRepEmployeeNumber            int  YES  MUL    None
12             creditLimit  decimal(10,2)  YES         None

,customerNumber,customerName,contactLastName,contactFirstName,phone,addressLine1,addressLine2,city,state,postalCode,country,salesRepEmployeeNumber,creditLimit
0,103,Atelier graphique,Schmitt,Carine,40.32.2555,"54, rue Royale",None,Nantes,None,44000,France,1370.0,21000.0
1,112,Signal Gift Stores,King,Jean,7025551838,8489 Strong St.,None,Las Vegas,NV,83030,USA,1166.0,71800.0
2,114,"Australian Collectors, Co.",Ferguson,Peter,03 9520 4555,636 St Kilda Road,Level 3,Melbourne,Victoria,3004,Australia,1611.0,117300.0